# YOLO26-Master 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26-based YOLO-Master with ES-MoE and A2C2f modules
# Combines YOLO26 backbone/head structure with YOLO-Master MoE routing

# Parameters
nc: 80 # number of classes
end2end: True # YOLO26 end-to-end mode
reg_max: 1 # DFL bins
scales:
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]

# YOLO26-Master backbone with ES-MoE
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, ES_MOE, [256]] # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, ES_MOE, [512]] # 6
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 8
  - [-1, 1, ES_MOE, [512]] # 9
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 11
  - [-1, 1, ES_MOE, [1024]] # 12
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 13
  - [-1, 2, C2PSA, [1024]] # 14

# YOLO26-Master head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 20 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 23 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 26 (P5/32-large)

  - [[20, 23, 26], 1, Detect, [nc]] # Detect(P3, P4, P5)
